app/Http/Controllers/Api/AttendanceApiController.php

select * from `tmp_rfids` limit 1
---
    public function handleScan()
    {
        $rfidData = TmpRfid::first();