app/Http/Controllers/Api/RFIDController.php

    public function index()
    {
        $rfid = TmpRfid::all();
---
select * from `tmp_rfids`