app/Http/Controllers/AdminController.php

    public function dashboard()
    {
        $users = User::where('is_admin', false)->count();
        $classes = StudentClass::count();
        $attendances = Attendance::count();
---
select count(*) as aggregate from `users` where `is_admin` = 0
select count(*) as aggregate from `student_classes`
select count(*) as aggregate from `attendances`