app/Http/Controllers/AttendanceController.php

    public function attendances()
    {
        $attendances = Attendance::with('student')->get();
        $statuses = Status::all();
---
select * from `attendances`
select * from `statuses`