app/Http/Controllers/PermissionController.php

    public function permissions()
    {
        $permissions = Permission::all();
---
select * from `permissions`