app/Http/Controllers/SettingController.php

select * from `modes` limit 1
select * from `time_limits` limit 1
---
    public function settings()
    {
        $mode = Mode::first();
        $modeName = ucfirst($mode->mode_name);
        $timeLimit = TimeLimit::first();

select * from `modes` limit 1
insert into `modes` (`mode_name`, `updated_at`, `created_at`) values ('pulang', '2025-05-30 06:39:53', '2025-05-30 06:39:53')
---
    public function mode(Request $request)
    {
        $currentMode = Mode::first();

        $newMode = ($currentMode && $currentMode->mode_name === 'masuk') ? 'pulang' : 'masuk';

        Mode::truncate();

        Mode::create([
            'mode_name' => $newMode,
        ]);