app/Http/Controllers/StatusController.php

select * from `statuses`
---
    public function statuses()
    {
        $statuses = Status::all();

select * from `statuses` where `statuses`.`id` = '5' limit 1
delete from `statuses` where `id` = 5
---
    public function destroy($id)
    {
        $user = Status::findOrFail($id);
        $user->delete();