app/Http/Controllers/StudentController.php

select * from `attendances` where `student_id` = 3
select * from `statuses`
---
    public function student()
    {
        $user = Auth::user();
        if (!$user) {
            return redirect()->route('login');
        }

        $attendances = Attendance::with('student')
            ->where('student_id', $user->id)
            ->get();

        $statuses = Status::all();

select * from `permissions` where `student_id` = 3
select * from `attendances` where `student_id` = 3
select * from `statuses`
---
    public function history()
    {
        $user = Auth::user();
        if (!$user) {
            return redirect()->route('login');
        }

        $permissions = Permission::with('student')
            ->where('student_id', $user->id)
            ->get();

        $attendances = Attendance::with('student')
            ->where('student_id', $user->id)
            ->get();
        $explanation = Status::all();