app/Http/Controllers/StudentClassController.php

select * from `student_classes`
---
    public function classes()
    {
        $classes = StudentClass::all();

insert into `student_classes` (`class_name`, `updated_at`, `created_at`) values ('XI SIJA A', '2025-05-30 06:39:37', '2025-05-30 06:39:37')
---
    public function addClass(Request $request)
    {
        $validated = $request->validate([
            'class_name' => 'required|string|max:10',
        ]);

        $name = Str::upper($request->class_name);

        $class = new StudentClass();
        $class->class_name = $name;
        $class->save();