app/Http/Controllers/UserController.php

select * from `student_classes`
select * from `users` where `is_admin` = 0 order by `absen` asc
---
    public function students()
    {
        $client = new Client();
        $url = "http://localhost:8001/api/kartu";
        $response = $client->request('GET', $url);
        $rfidJson = $response->getBody()->getContents();
        $rfidArray = json_decode($rfidJson, true)['data'];

        $classes = StudentClass::all();
        $students = User::where('is_admin', false)
                ->orderBy('absen', 'asc')
                ->get();

select * from `users` where `users`.`id` = '3' limit 1
---
    public function updateUser(Request $request, $id)
    {
        $validated = $request->validate([
            'card_number' => 'required|string|max:50',
            'absen' => 'required|numeric|max:99',
            'name' => 'required|string|max:75',
            'class_name' => 'required|exists:student_classes,id',
            'email' => 'required|email',
            'telepon' => 'required|string|max:14',
            'password' => 'nullable|min:3',
        ]);

        $name = Str::title($request->name);

        $user = User::findOrFail($id);